RIOT-OS/RIOT/cpu/sam0_common/include/vendor/samr30/include/pio/samr30g18a.h
#define PIN_PA24I_CCL_IN8              _L(24) /**< \brief CCL signal: IN8 on PA24 mux I */
#define MUX_PA24I_CCL_IN8               _L(8)
#define PINMUX_PA24I_CCL_IN8       ((PIN_PA24I_CCL_IN8 << 16) | MUX_PA24I_CCL_IN8)
#define PORT_PA24I_CCL_IN8     (_UL(1) << 24)
#define PIN_PB08I_CCL_IN8              _L(40) /**< \brief CCL signal: IN8 on PB08 mux I */
#define MUX_PB08I_CCL_IN8               _L(8)
#define PINMUX_PB08I_CCL_IN8       ((PIN_PB08I_CCL_IN8 << 16) | MUX_PB08I_CCL_IN8)
#define PORT_PB08I_CCL_IN8     (_UL(1) <<  8)
#define PIN_PB14I_CCL_IN9              _L(46) /**< \brief CCL signal: IN9 on PB14 mux I */
#define MUX_PB14I_CCL_IN9               _L(8)
#define PINMUX_PB14I_CCL_IN9       ((PIN_PB14I_CCL_IN9 << 16) | MUX_PB14I_CCL_IN9)
#define PORT_PB14I_CCL_IN9     (_UL(1) << 14)
#define PIN_PB15I_CCL_IN10             _L(47) /**< \brief CCL signal: IN10 on PB15 mux I */
#define MUX_PB15I_CCL_IN10              _L(8)
#define PINMUX_PB15I_CCL_IN10      ((PIN_PB15I_CCL_IN10 << 16) | MUX_PB15I_CCL_IN10)
#define PORT_PB15I_CCL_IN10    (_UL(1) << 15)
#define PIN_PB16I_CCL_IN11             _L(48) /**< \brief CCL signal: IN11 on PB16 mux I */
#define MUX_PB16I_CCL_IN11              _L(8)
#define PINMUX_PB16I_CCL_IN11      ((PIN_PB16I_CCL_IN11 << 16) | MUX_PB16I_CCL_IN11)
#define PORT_PB16I_CCL_IN11    (_UL(1) << 16)
#define PIN_PA07I_CCL_OUT0              _L(7) /**< \brief CCL signal: OUT0 on PA07 mux I */
#define MUX_PA07I_CCL_OUT0              _L(8)
#define PINMUX_PA07I_CCL_OUT0      ((PIN_PA07I_CCL_OUT0 << 16) | MUX_PA07I_CCL_OUT0)
#define PORT_PA07I_CCL_OUT0    (_UL(1) <<  7)
#define PIN_PA19I_CCL_OUT0             _L(19) /**< \brief CCL signal: OUT0 on PA19 mux I */
#define MUX_PA19I_CCL_OUT0              _L(8)
#define PINMUX_PA19I_CCL_OUT0      ((PIN_PA19I_CCL_OUT0 << 16) | MUX_PA19I_CCL_OUT0)
#define PORT_PA19I_CCL_OUT0    (_UL(1) << 19)
#define PIN_PB02I_CCL_OUT0             _L(34) /**< \brief CCL signal: OUT0 on PB02 mux I */
#define MUX_PB02I_CCL_OUT0              _L(8)
#define PINMUX_PB02I_CCL_OUT0      ((PIN_PB02I_CCL_OUT0 << 16) | MUX_PB02I_CCL_OUT0)
#define PORT_PB02I_CCL_OUT0    (_UL(1) <<  2)
#define PIN_PB23I_CCL_OUT0             _L(55) /**< \brief CCL signal: OUT0 on PB23 mux I */
#define MUX_PB23I_CCL_OUT0              _L(8)
#define PINMUX_PB23I_CCL_OUT0      ((PIN_PB23I_CCL_OUT0 << 16) | MUX_PB23I_CCL_OUT0)
#define PORT_PB23I_CCL_OUT0    (_UL(1) << 23)
#define PIN_PA11I_CCL_OUT1             _L(11) /**< \brief CCL signal: OUT1 on PA11 mux I */
#define MUX_PA11I_CCL_OUT1              _L(8)
#define PINMUX_PA11I_CCL_OUT1      ((PIN_PA11I_CCL_OUT1 << 16) | MUX_PA11I_CCL_OUT1)
#define PORT_PA11I_CCL_OUT1    (_UL(1) << 11)
#define PIN_PA31I_CCL_OUT1             _L(31) /**< \brief CCL signal: OUT1 on PA31 mux I */
#define MUX_PA31I_CCL_OUT1              _L(8)
#define PINMUX_PA31I_CCL_OUT1      ((PIN_PA31I_CCL_OUT1 << 16) | MUX_PA31I_CCL_OUT1)
#define PORT_PA31I_CCL_OUT1    (_UL(1) << 31)
#define PIN_PA25I_CCL_OUT2             _L(25) /**< \brief CCL signal: OUT2 on PA25 mux I */
#define MUX_PA25I_CCL_OUT2              _L(8)
#define PINMUX_PA25I_CCL_OUT2      ((PIN_PA25I_CCL_OUT2 << 16) | MUX_PA25I_CCL_OUT2)
#define PORT_PA25I_CCL_OUT2    (_UL(1) << 25)
#define PIN_PB09I_CCL_OUT2             _L(41) /**< \brief CCL signal: OUT2 on PB09 mux I */
#define MUX_PB09I_CCL_OUT2              _L(8)
#define PINMUX_PB09I_CCL_OUT2      ((PIN_PB09I_CCL_OUT2 << 16) | MUX_PB09I_CCL_OUT2)
#define PORT_PB09I_CCL_OUT2    (_UL(1) <<  9)
#define PIN_PB17I_CCL_OUT3             _L(49) /**< \brief CCL signal: OUT3 on PB17 mux I */
#define MUX_PB17I_CCL_OUT3              _L(8)
#define PINMUX_PB17I_CCL_OUT3      ((PIN_PB17I_CCL_OUT3 << 16) | MUX_PB17I_CCL_OUT3)
#define PORT_PB17I_CCL_OUT3    (_UL(1) << 17)

#endif /* _SAMR30G18A_PIO_ */
